package jvm;

public class MyObj {
  public static void main(String[] args) {
    //
//    不是bootstrap
//    用c++语言写的
//    最高级别
//    后台打印出null
//    不会同样的凉拌对大家负责 接下来 弟兄们
//    这是系统自带的
//    java 运行环境 rt。jar runtime object
//    方式为什么能够用object 跟加载器一开始了就加兹阿勒这个
//    这个了
    /**
     *
     * rt,jar
     * 先华仔
     *
     * 加载jar包
     * 网络通信服务器等 超级赛亚人
     * 白城编程
     * 马那么弄得
     * 后买你的
     * 后面添加的扩展包用
     * extens 罗湛啊
     * javaex e
     * java下拓展jam的
     * 拓展的意思
     * 于是究竟
     * 之所以没有被淘汰
     * 再加上拓展包
     * 那么我们呢
     * 简简单单的
     * 来看好一眼
     * 直接;爱噶
     * 有个lib
     * 我们在这找到了对应de
     * lujin
     * extens
     * 有个二五年间
     * 弟兄们这些装在进来
     * 沃迈一步汽车
     * 僧及
     * 拓展
     * 牛逼
     * 水路两用
     * 性的
     * 出来我是车
     * 改成齐娜汀
     * `请回答问题
     * 这是Ismail
     *
     * 上面鬼
     * 都明白 sun 代表上面
     * jvm相关调用的如骷髅成
     * 程序
     * 是到底是到
     * 拾到拾到了
     * jvm相关的入口程序
     * 世道删掉
     * 课
     * 说解脱
     *
     * 自带的加载器
     * 全是网上
     *
     * 双亲委派机制
     * 杀向安全
     * 双亲委派机制
     * classloader
     * 容器先三个
     * 四个
     * 心痛自带
     * 系统自带
     * 自定义加载器
     * 自定义一个类装载器
     * classloader
     * 自家嗨
     *
     *抽象类只能被继承
     * 具体化
     * 本省就不对
     * 本身就不对
     * 班长
     *
     *
     * 兄弟们
     * 一瓶水\
     * 抽象的东西不饿能shi
     * 不能实例化
     * 出两台的三种
     * 定制化开发
     * 特殊的
     *
     *
     *
     *
     * ali
     * java基础架构部
     * 标注你规范
     * 标注规范
     * 三加一
     * 耆那三
     * 前三个ajvae应用程序类加载器
     * 索要名吧弄得
     * 明白的第一层下次哦
     * 的知识
     */

    Object object = new MyObj();
    Object o = new Object();
    System.out.println();
  }

}
